controllers/TaskController.php

    public function actionIndex()
    {
        $query = Task::find()->all();

        $selected = 0;
        if (Yii::$app->request->isPost) {
            $type = $selected = $_POST["type"];
            if ($type != 0) {
                $query = Task::find()->where(['type' => $type])->all();
            }
        }

        $types = Tasktypes::find()->all();
---
SELECT * FROM `tasks`
SELECT * FROM `tasks` WHERE `type`='7'
SELECT * FROM `task_types`

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        $types=ArrayHelper::map(Tasktypes::find()->all(),'id','name');
---
SELECT * FROM `task_types`

    protected function findModel($id)
    {
        if (($model = Task::findOne($id)) !== null) {
---
SELECT * FROM `tasks` WHERE `id`='1'